<a href="https://colab.research.google.com/github/moyixinqing/CSE6040x/blob/master/Pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas DataFrame**

In [2]:
import pandas as pd

In [12]:
# construct DataFrame
d = {'Name':['Tom', 'Jack', 'Steve', 'Ricky', 'Tom'],'col1': [1, 2, 3, 4, 10], 'Time': ['15:11', '12:00', '14:12', '10:10','11:12']}
df = pd.DataFrame(data=d)
df

    Name  col1   Time
0    Tom     1  15:11
1   Jack     2  12:00
2  Steve     3  14:12
3  Ricky     4  10:10
4    Tom    10  11:12

In [ ]:
#pd.read_sql_query('SELECT * FROM Accidents LIMIT 5', conn)

In [13]:
# split string in a column
df['Hour'] = df['Time'].apply(lambda x: x.split(":")[0])
df

    Name  col1   Time Hour
0    Tom     1  15:11   15
1   Jack     2  12:00   12
2  Steve     3  14:12   14
3  Ricky     4  10:10   10
4    Tom    10  11:12   11

In [15]:
# groupby Name and count col1
df.groupby(['Name']).agg({'col1':'count'}).reset_index()

    Name  col1
0   Jack     1
1  Ricky     1
2  Steve     1
3    Tom     2

In [17]:
# sort decending by Hour and ascending by Name
df.sort_values(by = ['Hour','Name'],ascending = [False, True]).reset_index()

   index   Name  col1   Time Hour
0      0    Tom     1  15:11   15
1      2  Steve     3  14:12   14
2      1   Jack     2  12:00   12
3      4    Tom    10  11:12   11
4      3  Ricky     4  10:10   10